[
  {
    "id": 1,
    "name": "Pride and Prejudice",
    "description": "A classic novel by Jane Austen exploring themes of love and social standing.",
    "detailedDescription": "Sharp wit, social satire, and romantic tension make Pride and Prejudice one of the most beloved novels of all time. Elizabeth Bennet, spirited and intelligent, is determined to marry for love rather than wealth. Her path crosses with the proud and reserved Mr. Darcy, whose arrogance seems insufferable—until misunderstandings give way to deeper truths. Against the backdrop of Regency England, Austen dissects class, reputation, and the roles of women in society. What begins as a clash of tempers evolves into one of literature’s greatest love stories, built on growth, humility, and mutual respect. Beyond the romance, Austen’s humor and keen observations make the novel an enduring exploration of human nature, prejudice, and the courage to change one’s heart.",
    "price": 15.99,
    "category": "Classics",
    "imageUrl": "Pride&Prejudice.jpg",
    "inStock": true,
    "quantity": 100
  },
  {
    "id": 2,
    "name": "Moby-Dick",
    "description": "Herman Melville's epic tale of the hunt for the elusive white whale.",
    "detailedDescription": "Few novels capture obsession like Moby-Dick. Ishmael, a wandering sailor, joins the whaling ship Pequod, commanded by the grim Captain Ahab. Ahab’s singular purpose is to hunt and kill the great white whale, Moby Dick, who once maimed him. What begins as a sea voyage transforms into an epic struggle between man and nature, will and fate. Melville layers the narrative with philosophy, biblical imagery, and meditations on humanity’s place in the universe. Each chapter shifts between adventure, humor, and tragedy, painting the ocean as both majestic and merciless. Ahab’s relentless pursuit of vengeance ultimately consumes him, leaving readers with one of the most powerful warnings about obsession and the cost of defying nature’s mysteries.",
    "price": 18.99,
    "category": "Classics",
    "imageUrl": "MobyDick.jpg",
    "inStock": true,
    "quantity": 13
  },
  {
    "id": 3,
    "name": "The Adventures of Sherlock Holmes",
    "description": "A collection of twelve short stories by Sir Arthur Conan Doyle featuring detective Sherlock Holmes.",
    "detailedDescription": "The Adventures of Sherlock Holmes is a classic collection of twelve detective stories written by Sir Arthur Conan Doyle. It follows the brilliant detective Sherlock Holmes and his loyal friend Dr. John Watson as they solve puzzling cases in Victorian London. Holmes, with his razor-sharp intellect and keen eye for detail, unravels mysteries that baffle everyone else. From strange disappearances to cryptic letters, each case showcases his extraordinary powers of deduction. Dr. Watson, both narrator and companion, brings warmth and humanity to the tales. The stories feature memorable cases like \"A Scandal in Bohemia\" and \"The Adventure of the Speckled Band\".Holmes often faces cunning criminals, hidden motives, and dramatic twists that keep readers enthralled. Themes of justice, logic, and moral dilemmas run throughout the collection. The book cemented Holmes as one of the most iconic fictional detectives of all time. Even today, these stories remain timeless, entertaining, and intellectually engaging.",
    "price": 12.99,
    "category": "Mystery",
    "imageUrl": "SherlockHolmes.jpg",
    "inStock": true,
    "quantity": 99
  },
  {
    "id": 4,
    "name": "The Great Gatsby",
    "description": "F. Scott Fitzgerald's novel about the American Dream and the Jazz Age.",
    "detailedDescription": "F. Scott Fitzgerald’s The Great Gatsby paints a vivid portrait of the Jazz Age in 1920s New York. It follows Jay Gatsby, a wealthy and enigmatic man, who throws extravagant parties in hopes of rekindling a past love with Daisy Buchanan. Narrated by Nick Carraway, Gatsby’s neighbor, the novel explores the allure of wealth, luxury, and status. Beneath the glamour lies loneliness, obsession, and heartbreak. Themes of the American Dream, social class, and moral decay run throughout the story. Fitzgerald examines how desire and ambition can blind people to reality. The narrative is both romantic and tragic, with moments of humor and sharp social observation. Gatsby’s relentless pursuit of a dream that may never return makes the story timeless. It remains a profound commentary on hope, illusion, and the human longing for connection.",
    "price": 14.99,
    "category": "Classics",
    "imageUrl": "Gatsby.jpg",
    "inStock": true,
    "quantity": 98
  },
  {
    "id": 5,
    "name": "Dracula",
    "description": "Bram Stoker's gothic horror novel introducing Count Dracula.",
    "detailedDescription": "Bram Stoker’s Dracula is the definitive gothic horror tale introducing Count Dracula, a centuries-old vampire. The story begins with Jonathan Harker’s visit to Dracula’s castle in Transylvania, where dark secrets and chilling mysteries unfold. Dracula travels to England, threatening lives with his supernatural powers. A group of determined characters, including Van Helsing, band together to confront the Count. Themes of fear, sexuality, and mortality permeate the novel. Stoker combines suspense, epistolary storytelling, and rich atmosphere to terrify readers. The story explores the clash between modernity and ancient evil. It has inspired countless adaptations, making Dracula an enduring icon of horror literature. Through vivid descriptions and psychological tension, the novel keeps readers on edge until the final confrontation.",
    "price": 16.99,
    "category": "Horror",
    "imageUrl": "Dracula.jpg",
    "inStock": true,
    "quantity": 100
  },
  {
    "id": 6,
    "name": "Frankenstein",
    "description": "Mary Shelley's tale of a scientist who creates a living being from body parts.",
    "detailedDescription": "Mary Shelley’s Frankenstein tells the haunting story of Victor Frankenstein, a scientist obsessed with creating life. Using parts of dead bodies, he brings a living being into the world, but his creation is shunned and misunderstood. The creature, intelligent yet lonely, struggles with rejection and seeks revenge on its creator. Themes of ambition, responsibility, and the consequences of playing God are central to the novel. Shelley explores human nature, morality, and the thin line between genius and madness. The story is both a gothic horror tale and a philosophical meditation on creation and suffering. Victor’s obsession destroys him, while the creature’s longing for acceptance evokes sympathy. The novel raises questions about empathy, isolation, and the ethical limits of science. Its enduring relevance makes it a cornerstone of both horror and science fiction.",
    "price": 13.99,
    "category": "Horror",
    "imageUrl": "Frankenstein.jpg",
    "inStock": true,
    "quantity": 45
  },
  {
    "id": 7,
    "name": "The Picture of Dorian Gray",
    "description": "Oscar Wilde's novel about a man whose portrait ages instead of him.",
    "detailedDescription": "Oscar Wilde’s The Picture of Dorian Gray is a dark exploration of vanity, morality, and corruption. Dorian Gray, a handsome young man, wishes that his portrait would age instead of him, and the wish is mysteriously granted. While his appearance remains youthful, the painting absorbs the effects of his immoral choices. Influenced by Lord Henry, Dorian indulges in a life of hedonism, decadence, and cruelty. The novel examines the consequences of selfishness and obsession with eternal beauty. Themes of identity, art, and the duality of human nature are explored throughout. As Dorian spirals deeper into vice, the portrait becomes a haunting reminder of his corruption. Wilde blends gothic elements, philosophical reflections, and sharp social commentary. The story is both a cautionary tale and a compelling meditation on aesthetics, morality, and the price of indulgence.",
    "price": 17.99,
    "category": "Classics",
    "imageUrl": "DorianGray.jpg",
    "inStock": true,
    "quantity": 81
  },
  {
    "id": 8,
    "name": "War and Peace",
    "description": "Leo Tolstoy's epic novel set during the Napoleonic Wars.",
    "detailedDescription": "Tolstoy’s monumental epic weaves together the lives of aristocrats, soldiers, and peasants during the Napoleonic Wars. At its core are the journeys of Pierre Bezukhov, Prince Andrei Bolkonsky, and Natasha Rostov—characters who grapple with love, purpose, and the search for meaning amidst chaos. Tolstoy masterfully blends historical events with intimate human struggles, showing how personal lives intersect with the sweep of history. The novel is as much about inner battles—pride, despair, and redemption—as it is about cannons and armies. With unmatched psychological depth, Tolstoy portrays life as a tapestry of suffering and beauty, tragedy and joy. Though vast in scope, War and Peace remains deeply personal, reminding us that the greatest victories often happen within the soul.",
    "price": 20.99,
    "category": "Historical Fiction",
    "imageUrl": "War&Peace.jpg",
    "inStock": false,
    "quantity": 0
  },
  {
    "id": 9,
    "name": "The Odyssey",
    "description": "Homer's ancient Greek epic poem about Odysseus's journey home.",
    "detailedDescription": "Homer’s The Odyssey is an epic poem recounting the adventures of Odysseus as he strives to return home after the Trojan War. Facing storms, mythical creatures, and divine interventions, Odysseus demonstrates cleverness, courage, and endurance. The poem explores themes of loyalty, hospitality, fate, and the power of cunning over brute strength. Along the journey, he encounters sirens, cyclopes, and the wrath of gods, testing his resolve. His wife Penelope and son Telemachus await him at home, embodying patience and hope. The narrative blends action, mythology, and moral lessons for both rulers and common people. Odysseus’s journey is not just physical but also an exploration of human character and resilience. It remains a cornerstone of classical literature, influencing countless stories and myths. The epic celebrates the enduring quest for home, identity, and honor.",
    "price": 11.99,
    "category": "Classics",
    "imageUrl": "Odyssey.jpg",
    "inStock": true,
    "quantity": 100
  },
  {
    "id": 10,
    "name": "The Brothers Karamazov",
    "description": "Fyodor Dostoevsky's philosophical novel exploring morality and faith.",
    "detailedDescription": "Dostoevsky’s The Brothers Karamazov is a profound exploration of faith, morality, and the complexities of human nature. The novel follows the lives of the Karamazov brothers, each embodying different worldviews and moral struggles. Themes of love, jealousy, guilt, and redemption permeate the story, intertwined with philosophical debates. At its core is the murder of their father, which sets off questions of justice, conscience, and responsibility. Dostoevsky examines the tension between reason and spirituality, freedom and fate. The characters grapple with doubt, temptation, and the pursuit of truth in a morally ambiguous world. Through intricate storytelling, the novel challenges readers to reflect on morality, suffering, and forgiveness. It remains one of the greatest philosophical and literary achievements of Russian literature. The work combines deep psychological insight with narrative mastery.",
    "price": 19.99,
    "category": "Philosophy",
    "imageUrl": "Karamazov.jpg",
    "inStock": true,
    "quantity": 100
  },
  {
    "id": 11,
    "name": "Anna Karenina",
    "description": "Tolstoy's masterpiece exploring love and society in Russia.",
    "detailedDescription": "Tolstoy’s Anna Karenina is a sweeping tale of love, passion, and societal expectations in 19th-century Russia. The story centers on Anna, whose affair with Count Vronsky challenges the rigid social norms of her time. Tolstoy contrasts urban high society with the quiet life of Russian peasants, exploring class and morality. Themes of desire, duty, betrayal, and the consequences of personal choices run throughout. Anna’s emotional struggles and tragic fate reveal the human cost of societal pressures. The novel also follows subplots, including the spiritual journey of Konstantin Levin, offering philosophical reflection. Tolstoy’s detailed depictions of nature, culture, and human psychology enrich the narrative. The story examines the tension between personal happiness and moral responsibility. Anna Karenina is celebrated as a masterpiece of character development and social critique.",
    "price": 21.99,
    "category": "Classics",
    "imageUrl": "Karenina.jpg",
    "inStock": true,
    "quantity": 100
  },
  {
    "id": 12,
    "name": "Great Expectations",
    "description": "Charles Dickens’ story of the orphan Pip and his journey to wealth.",
    "detailedDescription": "Charles Dickens’ Great Expectations follows the life of Pip, an orphan who dreams of rising above his humble beginnings. The novel explores ambition, wealth, love, and the complexities of human relationships. Pip’s encounters with eccentric characters like Miss Havisham and Estella shape his understanding of society and morality. Themes of social class, personal growth, and the consequences of choices are central to the story. Dickens weaves humor, pathos, and sharp social commentary throughout the narrative. Pip learns that true gentility is not measured by wealth or status but by character and compassion. The novel combines adventure, romance, and mystery, keeping readers engaged at every turn. Its portrayal of human fallibility and redemption makes it timeless and relevant. The story remains a vivid exploration of aspiration, regret, and personal transformation.",
    "price": 16.49,
    "category": "Classics",
    "imageUrl": "GreatExpectations.jpg",
    "inStock": false,
    "quantity": 0
  },
  {
    "id": 13,
    "name": "Alice's Adventures in Wonderland",
    "description": "Lewis Carroll’s whimsical tale of Alice in a magical land.",
    "detailedDescription": "Lewis Carroll’s Alice’s Adventures in Wonderland is a whimsical tale of a young girl named Alice who falls into a magical and nonsensical world. She encounters eccentric characters such as the Cheshire Cat, the Mad Hatter, and the Queen of Hearts. The story blends fantasy, logic puzzles, and playful language, creating a surreal reading experience. Themes of curiosity, identity, and imagination run throughout Alice’s adventures. Carroll explores the boundaries of reality and nonsense with wit and creativity. Alice’s journey is both entertaining and thought-provoking, appealing to children and adults alike. The narrative challenges conventional logic, inviting readers to question rules and expectations. It remains a seminal work in fantasy literature, celebrated for its inventiveness and charm. The book’s enduring popularity has inspired countless adaptations in film, theater, and art.",
    "price": 12.99,
    "category": "Fantasy",
    "imageUrl": "AliceInWonderland.jpg",
    "inStock": true,
    "quantity": 53
  },
  {
    "id": 14,
    "name": "Through the Looking-Glass",
    "description": "Sequel to Alice’s Adventures with more imaginative adventures.",
    "detailedDescription": "In this whimsical sequel, Alice steps through the looking-glass into a mirror-world where everything is reversed. She encounters peculiar characters like Tweedledum and Tweedledee, the Red Queen, and Humpty Dumpty. The narrative explores logic puzzles, wordplay, and fantastical landscapes. Alice navigates a chessboard-like world, moving from square to square in her journey. Themes of identity, curiosity, and imagination continue from the first book. The story is filled with humor, riddles, and clever observations about society. Carroll’s language remains playful, engaging both children and adults. Adventures are both entertaining and thought-provoking. The book highlights creativity and the joy of discovery. Alice learns to adapt to absurdity and change.",
    "price": 13.49,
    "category": "Fantasy",
    "imageUrl": "LookingGlass.jpg",
    "inStock": true,
    "quantity": 100
  },
  {
    "id": 15,
    "name": "The Count of Monte Cristo",
    "description": "Alexandre Dumas' tale of betrayal, revenge, and redemption.",
    "detailedDescription": "Edmond Dantès is a young sailor falsely accused of treason and imprisoned for years. During captivity, he learns of a hidden treasure on the island of Monte Cristo. After escaping, Dantès transforms into the wealthy and mysterious Count of Monte Cristo. He executes elaborate plans of revenge against those who wronged him. The novel explores themes of justice, betrayal, forgiveness, and human ambition. Dumas examines the moral consequences of revenge and the nature of true justice. Adventure, intrigue, and suspense dominate the narrative. Characters are vividly drawn, from villains to loyal friends. Dantès’s journey is both thrilling and morally complex. Ultimately, the story balances vengeance with redemption.",
    "price": 18.99,
    "category": "Adventure",
    "imageUrl": "MonteCristo.jpg",
    "inStock": true,
    "quantity": 100
  },
  {
    "id": 16,
    "name": "Treasure Island",
    "description": "Robert Louis Stevenson’s adventure about pirates and buried treasure.",
    "detailedDescription": "Jim Hawkins discovers a treasure map and sets off on a perilous sea adventure. He joins a crew headed to a distant island in search of pirate treasure. The story introduces iconic characters such as Long John Silver and his cunning pirates. Themes of courage, loyalty, greed, and morality run throughout the tale. Jim learns valuable lessons about trust, bravery, and the dangers of deception. The narrative is full of suspense, mutinies, and unexpected twists. Stevenson’s vivid descriptions bring the island and seafaring life to life. The novel combines adventure, mystery, and coming-of-age elements. It is celebrated as one of the greatest pirate stories of all time. Jim’s journey teaches growth and the cost of ambition.",
    "price": 14.99,
    "category": "Adventure",
    "imageUrl": "TreasureIsland.jpg",
    "inStock": true,
    "quantity": 100
  },
  {
    "id": 17,
    "name": "Twenty Thousand Leagues Under the Sea",
    "description": "Jules Verne's story of Captain Nemo and the submarine Nautilus.",
    "detailedDescription": "Professor Aronnax, his servant Conseil, and harpooner Ned Land are captured by Captain Nemo aboard the submarine Nautilus. They explore the depths of the ocean, witnessing exotic marine life and underwater phenomena. Themes of science, exploration, and the unknown are central to the novel. Captain Nemo’s mysterious past and philosophy challenge their moral perceptions. Adventures include battles with sea monsters and navigating treacherous waters. The narrative combines scientific imagination with thrilling suspense. Verne’s detailed descriptions make readers feel immersed in the underwater world. The story reflects humanity’s curiosity and the consequences of isolation. Friendship, freedom, and discovery are explored throughout. The novel is a classic of science fiction and adventure literature.",
    "price": 15.99,
    "category": "Science Fiction",
    "imageUrl": "UnderTheSea.jpg",
    "inStock": true,
    "quantity": 12
  },
  {
    "id": 18,
    "name": "Journey to the Center of the Earth",
    "description": "Verne's novel about an underground expedition.",
    "detailedDescription": "Professor Lidenbrock discovers a mysterious manuscript revealing a path to the Earth’s core. He, his nephew Axel, and their guide Hans embark on a daring subterranean expedition. They encounter underground seas, prehistoric creatures, and geological wonders. Themes of scientific curiosity, adventure, and perseverance dominate the story. Axel struggles with fear and doubt while witnessing incredible natural phenomena. The narrative combines suspense, exploration, and educational insights. Verne’s attention to scientific details adds realism to the fantastic journey. The trio faces numerous challenges and dangers in the unknown depths. Friendship, courage, and ingenuity are essential to their survival. The story inspires imagination and the spirit of discovery.",
    "price": 13.99,
    "category": "Science Fiction",
    "imageUrl": "CenterOfEarth.jpg",
    "inStock": true,
    "quantity": 100
  },
  {
    "id": 19,
    "name": "The Time Machine",
    "description": "H.G. Wells’ story of a man who travels to the distant future.",
    "detailedDescription": "A scientist known as the Time Traveller invents a machine that can move through time. He journeys to the distant future, witnessing the evolution of humanity and the decline of civilization. The novel explores themes of social inequality, progress, and human nature. He encounters the peaceful Eloi and the menacing Morlocks, representing societal divisions. Wells examines the potential consequences of technological and social development. The narrative blends adventure, science fiction, and philosophical reflection. The Time Traveller experiences wonder, fear, and profound insight about the passage of time. Themes of mortality, change, and responsibility are explored. The story is imaginative, suspenseful, and thought-provoking. Wells critiques the hubris of human assumptions about progress.",
    "price": 12.99,
    "category": "Science Fiction",
    "imageUrl": "TimeMachine.jpg",
    "inStock": true,
    "quantity": 100
  },
  {
    "id": 20,
    "name": "The Invisible Man",
    "description": "Another Wells classic about a man who discovers invisibility.",
    "detailedDescription": "Griffin, a scientist obsessed with the study of optics, discovers how to become invisible. At first fascinated by his newfound power, he soon faces isolation, fear, and moral dilemmas. The story explores themes of science, ethics, and the abuse of power. Griffin’s descent into madness showcases the dangers of unchecked ambition. Suspense builds as he commits crimes and struggles to remain unseen. The narrative is tense, thrilling, and psychologically rich. Wells examines human nature, the desire for control, and the consequences of isolation. Griffin’s invisibility serves as both a blessing and a curse. The novel highlights the tension between intellect and morality. It remains a classic of science fiction and cautionary storytelling.",
    "price": 14.99,
    "category": "Science Fiction",
    "imageUrl": "InvisibleMan.jpg",
    "inStock": false,
    "quantity": 0
  },
  {
    "id": 21,
    "name": "Jane Eyre",
    "description": "Charlotte Bronte's tale of love, morality, and independence.",
    "detailedDescription": "Jane Eyre is an orphan who faces hardship, abuse, and loneliness in her early life. She grows into a strong, independent woman with a keen sense of morality. Jane becomes a governess at Thornfield Hall, where she meets the enigmatic Mr. Rochester. Their love is tested by secrets, social expectations, and moral dilemmas. Themes of resilience, integrity, and self-respect run throughout the novel. Bronte explores gender roles, class, and the tension between passion and duty. The narrative is rich with Gothic elements, suspense, and deep psychological insight. Jane’s journey emphasizes personal growth and the pursuit of true love. The story is inspiring and emotionally compelling. Bronte’s prose combines romance, social critique, and moral reflection.",
    "price": 16.99,
    "category": "Romance",
    "imageUrl": "JaneEyre.jpg",
    "inStock": true,
    "quantity": 100
  },
  {
    "id": 22,
    "name": "Wuthering Heights",
    "description": "Emily Bronte's story of passionate love and revenge.",
    "detailedDescription": "Set on the Yorkshire moors, *Wuthering Heights* tells the story of Heathcliff and Catherine, whose intense love leads to tragedy. Themes of passion, revenge, and social constraints dominate the novel. Generations of families are affected by the consequences of Heathcliff’s obsession. The narrative explores the destructive and redemptive aspects of love. Emily Bronte uses multiple narrators to create depth and perspective. Characters grapple with jealousy, resentment, and longing. Gothic elements enhance the dark, moody atmosphere. The novel examines human emotion, social class, and the clash between nature and society. Love, suffering, and forgiveness intertwine throughout the story. It is a powerful exploration of desire, obsession, and fate.",
    "price": 15.49,
    "category": "Romance",
    "imageUrl": "WutheringHeights.jpg",
    "inStock": false,
    "quantity": 0
  },
  {
    "id": 23,
    "name": "Sense and Sensibility",
    "description": "Jane Austen’s novel of manners, love, and family.",
    "detailedDescription": "The novel follows the Dashwood sisters, Elinor and Marianne, as they navigate love, heartbreak, and social expectations. Elinor embodies reason and restraint, while Marianne represents passion and impulsiveness. They experience financial hardship and romantic complications after their father’s death. Austen explores themes of social class, morality, and the tension between sense and sensibility. Family loyalty and friendship play crucial roles in their growth. Misunderstandings, emotional trials, and societal pressures shape their journeys. The story is full of wit, humor, and keen observation of 19th-century English society. Both sisters mature through experiences of love and disappointment. The novel balances comedy, romance, and moral insight, remaining a timeless classic.",
    "price": 14.99,
    "category": "Classics",
    "imageUrl": "Sense.jpg",
    "inStock": false,
    "quantity": 0
  },
  {
    "id": 24,
    "name": "Emma",
    "description": "Another Austen novel exploring matchmaking and social expectations.",
    "detailedDescription": "Emma Woodhouse is a clever young woman who enjoys matchmaking in her small English town. Her confidence leads to comic misadventures, misunderstandings, and lessons in humility. She learns that meddling in others’ affairs can have unintended consequences. Austen explores themes of social class, marriage, and personal growth. Emma’s journey includes romance, self-discovery, and moral reflection. The narrative is rich with humor, wit, and keen observations about society. Characters are vividly drawn, from the charming to the flawed. Emma gradually matures and learns the importance of empathy and sincerity. Romantic entanglements provide both tension and amusement. Austen’s storytelling blends social critique with character-driven narrative.",
    "price": 15.99,
    "category": "Classics",
    "imageUrl": "Emma.jpg",
    "inStock": false,
    "quantity": 0
  },
  {
    "id": 25,
    "name": "North and South",
    "description": "Elizabeth Gaskell’s story of love across social classes.",
    "detailedDescription": "Margaret Hale moves from the rural South to the industrial North of England, encountering cultural and social differences. She witnesses the struggles of mill workers and the challenges faced by factory owners. Themes of class, morality, and social responsibility are central. Margaret develops a complex relationship with John Thornton, a mill owner, which evolves into love. Gaskell portrays industrial life vividly, highlighting social inequality and empathy. Margaret’s intelligence, courage, and compassion guide her choices. Conflicts, misunderstandings, and societal pressures test relationships and moral values. The novel blends romance, social critique, and moral lessons. Margaret and Thornton learn understanding, respect, and reconciliation. The story emphasizes integrity, growth, and human connection.",
    "price": 16.99,
    "category": "Romance",
    "imageUrl": "North&South.jpg",
    "inStock": true,
    "quantity": 100
  },
  {
    "id": 26,
    "name": "Little Women",
    "description": "Louisa May Alcott's classic about the four March sisters.",
    "detailedDescription": "Little Women follows the lives of the four March sisters—Meg, Jo, Beth, and Amy—as they grow up during the American Civil War. The novel explores family bonds, love, and personal ambition. Each sister faces challenges in school, work, and society while striving to achieve her own dreams. Themes of morality, sisterhood, and perseverance are central. Jo’s independent spirit and love of writing drive much of the narrative. The story includes romance, tragedy, joy, and domestic life. Alcott emphasizes personal growth, resilience, and compassion. The March family navigates poverty, illness, and social expectations. Their individual choices shape their paths to adulthood. The novel remains a timeless reflection on family, love, and self-discovery.",
    "price": 14.99,
    "category": "Family",
    "imageUrl": "LittleWomen.jpg",
    "inStock": false,
    "quantity": 0
  },
  {
    "id": 27,
    "name": "Heidi",
    "description": "Johanna Spyri's story of a young girl in the Swiss Alps.",
    "detailedDescription": "Heidi, a young orphan, is sent to live with her grandfather in the Swiss Alps. She adapts to mountain life and forms deep bonds with her grandfather and friends. The novel explores themes of nature, innocence, and the healing power of kindness. Heidi’s optimism and compassion influence those around her, including Clara, a disabled girl from the city. The story highlights family, friendship, and resilience in the face of adversity. Heidi’s connection to nature provides joy and moral lessons. Cultural contrasts between rural and urban life are depicted. The narrative emphasizes simplicity, love, and emotional growth. Spyri’s story remains an enduring classic for children and adults alike. It celebrates the virtues of compassion, courage, and empathy.",
    "price": 12.99,
    "category": "Children",
    "imageUrl": "Heidi.jpg",
    "inStock": true,
    "quantity": 92
  },
  {
    "id": 28,
    "name": "Black Beauty",
    "description": "Anna Sewell's novel told from the perspective of a horse.",
    "detailedDescription": "Black Beauty tells the life story of a horse, sharing experiences of kindness and cruelty from humans. The novel highlights themes of empathy, animal welfare, and compassion. Readers witness various owners and the treatment of horses in 19th-century England. Through Black Beauty’s eyes, Sewell emphasizes moral responsibility and humane treatment of animals. The narrative includes adventure, hardship, and resilience. Horses, and the humans they interact with, face trials that teach lessons about patience and care. Themes of friendship, loyalty, and endurance run throughout the story. The novel encourages ethical behavior and kindness toward animals. It remains a classic with strong moral and emotional impact. Sewell’s vivid storytelling fosters empathy in readers of all ages.",
    "price": 13.99,
    "category": "Children",
    "imageUrl": "BlackBeauty.jpg",
    "inStock": true,
    "quantity": 87
  },
  {
    "id": 29,
    "name": "The Secret Garden",
    "description": "Frances Hodgson Burnett's story of a magical garden and personal growth.",
    "detailedDescription": "Mary Lennox, a spoiled and lonely girl, discovers a hidden, neglected garden on her uncle’s estate. She begins to restore it, transforming both the garden and her own personality. Themes of friendship, nature, healing, and personal growth are central. Mary befriends Dickon and Colin, helping them discover confidence and joy. The story emphasizes the restorative power of nature and compassion. Secrets, mysteries, and emotional challenges drive the narrative. The garden becomes a symbol of rejuvenation and hope. Characters evolve as they learn empathy, resilience, and the value of caring for others. Burnett’s tale is magical, heartwarming, and timeless. The novel celebrates growth, wonder, and the transformative power of love and nature.",
    "price": 14.49,
    "category": "Children",
    "imageUrl": "SecretGarden.jpg",
    "inStock": true,
    "quantity": 67
  },
  {
    "id": 30,
    "name": "Peter Pan",
    "description": "J.M. Barrie's tale of the boy who never grows up.",
    "detailedDescription": "Peter Pan is the boy who refuses to grow up, living in the magical world of Neverland. He leads the Lost Boys and enjoys adventures with fairies, pirates, and mermaids. Wendy, John, and Michael Darling visit Neverland and experience its wonders and dangers. Themes of childhood innocence, freedom, and imagination are central. Peter’s rivalry with Captain Hook brings excitement and peril. The story explores growing up, nostalgia, and the fleeting nature of youth. Characters encounter friendship, bravery, and loyalty. Magic, fantasy, and whimsy permeate the tale. Barrie’s storytelling celebrates adventure, wonder, and the joy of imagination. Peter Pan remains a timeless classic for children and adults.",
    "price": 15.49,
    "category": "Fantasy",
    "imageUrl": "PeterPan.jpg",
    "inStock": true,
    "quantity": 34
  },
  {
    "id": 31,
    "name": "Robinson Crusoe",
    "description": "Daniel Defoe's adventure novel about survival on a deserted island.",
    "detailedDescription": "Robinson Crusoe is shipwrecked on a deserted island and must survive using his wits and determination. He constructs a shelter, hunts for food, and cultivates crops to sustain himself. Crusoe faces loneliness, fear, and the challenges of isolation. Over time, he discovers resources, builds tools, and adapts to island life. Themes of self-reliance, ingenuity, and human resilience are central. He eventually encounters natives and forms relationships that shape his experience. Crusoe reflects on society, morality, and providence. Adventure, exploration, and survival drive the narrative. Defoe provides detailed realism that immerses readers in Crusoe’s world. The novel celebrates courage, persistence, and human adaptability.",
    "price": 13.99,
    "category": "Adventure",
    "imageUrl": "Robinson.jpg",
    "inStock": true,
    "quantity": 100
  },
  {
    "id": 32,
    "name": "Gulliver’s Travels",
    "description": "Jonathan Swift's satirical tale of Lemuel Gulliver’s voyages.",
    "detailedDescription": "Gulliver’s Travels follows Lemuel Gulliver on a series of fantastical voyages to strange lands. He encounters the tiny Lilliputians, the giants of Brobdingnag, and the rational Houyhnhnms, among others. Swift satirizes human nature, politics, and society through Gulliver’s adventures. Themes include pride, corruption, and the absurdity of social conventions. Gulliver’s experiences reveal flaws and follies of mankind. The narrative blends humor, adventure, and moral reflection. Gulliver undergoes personal growth and increased awareness of human limitations. The novel critiques power, governance, and societal norms. Swift’s imaginative storytelling entertains while provoking thought. The work remains a classic of satire and adventure literature.",
    "price": 14.99,
    "category": "Satire",
    "imageUrl": "Gulliver.jpg",
    "inStock": false,
    "quantity": 0
  },
  {
    "id": 33,
    "name": "The Call of the Wild",
    "description": "Jack London's novel about a dog’s survival in the Yukon.",
    "detailedDescription": "The Call of the Wild tells the story of Buck, a domesticated dog stolen and sold into the harsh life of the Yukon during the Gold Rush. Buck learns to survive through instinct, courage, and adaptability. He faces brutal conditions, rival dogs, and harsh masters, gradually embracing his wild nature. Themes of survival, primal instinct, and the clash between civilization and nature are central. Buck forms deep bonds with humans and fellow animals. London portrays the wilderness with vivid detail and suspense. The story explores loyalty, power, and transformation. Buck ultimately answers the call of the wild, becoming a leader in the wild. Adventure, struggle, and self-discovery shape the narrative. The novel highlights resilience and the raw beauty of nature.",
    "price": 12.99,
    "category": "Adventure",
    "imageUrl": "CallOfTheWild.jpg",
    "inStock": true,
    "quantity": 23
  },
  {
    "id": 34,
    "name": "White Fang",
    "description": "Jack London’s story of a wolfdog in the Yukon.",
    "detailedDescription": "White Fang is born in the wild but later encounters humans who influence his fate. He learns to navigate the brutal wilderness of the Yukon, relying on strength and cunning. Themes of survival, nature versus nurture, and loyalty are explored. White Fang experiences both cruelty and kindness, shaping his character and trust in humans. The novel details harsh conditions, dogfights, and human settlements. London examines instinct, adaptation, and the bond between humans and animals. White Fang transforms from a feral creature to a loyal companion through patience and care. Adventure, danger, and emotional depth drive the story. The narrative portrays resilience, courage, and the interplay of nature and civilization. London’s tale remains a powerful reflection on animal life and humanity.",
    "price": 13.49,
    "category": "Adventure",
    "imageUrl": "WhiteFang.jpg",
    "inStock": true,
    "quantity": 64
  },
  {
    "id": 35,
    "name": "Thus Spoke Zarathustra",
    "description": "Nietzsche’s seminal work on morality, freedom, and the concept of the Übermensch.",
    "detailedDescription": "Friedrich Nietzsche’s Thus Spoke Zarathustra presents the teachings of the prophet Zarathustra, who descends from solitude to share his vision of human potential. The work explores the death of God, the rise of nihilism, and the idea of the Übermensch (Overman), who transcends conventional morality to create new values. Written in a poetic and allegorical style, the book challenges readers to reconsider morality, truth, and the meaning of existence. It remains one of the most influential and controversial works in Western philosophy.",
    "price": 17.5,
    "category": "Philosophy",
    "imageUrl": "Zarathustra.jpg",
    "inStock": true,
    "quantity": 80
  },
  {
    "id": 36,
    "name": "Critique of Pure Reason",
    "description": "Immanuel Kant’s foundational work in modern philosophy on knowledge and reason.",
    "detailedDescription": "Immanuel Kant’s Critique of Pure Reason revolutionized philosophy by addressing the limits and scope of human understanding. Kant investigates how we experience the world, distinguishing between phenomena (things as they appear) and noumena (things in themselves). He examines concepts such as space, time, and causality, while developing his theory of transcendental idealism. This complex but groundbreaking work lays the foundation for much of modern philosophy and remains essential for anyone exploring metaphysics and epistemology.",
    "price": 22.99,
    "category": "Philosophy",
    "imageUrl": "KantCritique.jpg",
    "inStock": true,
    "quantity": 60
  },
  {
    "id": 37,
    "name": "Murder on the Orient Express",
    "description": "A classic Hercule Poirot mystery by Agatha Christie set on the famous train.",
    "detailedDescription": "Murder on the Orient Express features the legendary detective Hercule Poirot as he investigates a murder aboard the luxurious Orient Express train. Stranded by a snowdrift, Poirot must solve the case among a confined set of passengers, each with secrets and motives. The story is renowned for its intricate plotting, clever misdirection, and a surprise ending that remains one of Christie’s most famous twists. Themes of justice, morality, and human psychology are woven throughout, making it a timeless mystery novel.",
    "price": 14.5,
    "category": "Mystery",
    "imageUrl": "MurderOnOrientExpress.jpg",
    "inStock": true,
    "quantity": 59
  },
  {
    "id": 38,
    "name": "The Hound of the Baskervilles",
    "description": "A thrilling Sherlock Holmes adventure involving a legendary family curse.",
    "detailedDescription": "In The Hound of the Baskervilles, Sherlock Holmes and Dr. Watson investigate the mysterious death of Sir Charles Baskerville on the foggy moors of Devonshire. Legends of a supernatural hound haunting the Baskerville family cast fear and suspicion over the case. Holmes employs his brilliant deductive skills to uncover the truth behind the ominous events. This novel combines suspense, gothic atmosphere, and intricate detective work, cementing Holmes as a master of solving complex mysteries.",
    "price": 13.99,
    "category": "Mystery",
    "imageUrl": "HoundOfBaskervilles.jpg",
    "inStock": true,
    "quantity": 90
  },
  {
    "id": 39,
    "name": "Animal Farm",
    "description": "George Orwell's allegorical novella about political corruption and totalitarianism.",
    "detailedDescription": "Animal Farm is an allegorical tale in which farm animals overthrow their human owner, only to see a new tyranny emerge under the pigs’ leadership. Orwell critiques totalitarian regimes, the corruption of ideals, and the cyclical nature of oppression. The novella uses satire, allegory, and symbolism to explore political manipulation, propaganda, and social injustice. Its concise, powerful narrative exposes human flaws and the dangers of unchecked power, remaining highly relevant as a political commentary.",
    "price": 12.5,
    "category": "Satire",
    "imageUrl": "AnimalFarm.jpg",
    "inStock": true,
    "quantity": 23
  }
]